# PowerLoadUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..PowerLoadUnit Property
Space Class See Also
---
Get or set the Power Load Unit of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BaseLoadOn PowerLoadUnit { get; set; }
```

Visual Basic
---
```text
Public Property PowerLoadUnit As BaseLoadOn
	Get
	Set
```

Visual C++
---
```text
public:
property BaseLoadOn PowerLoadUnit {
	BaseLoadOn get ();
	void set (BaseLoadOn value);
}
```

# Remarks
This property is used to get or set the Power Load Unit of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace